In [3]:
import pandas as pd
import numpy as np

s = pd.Series(([1,2,3,4,5, np.nan,6,7,8]))
s

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    NaN
6    6.0
7    7.0
8    8.0
dtype: float64

In [6]:
# create a date range starting at an ISO-formatted date (YYYY-MM-DD)
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
# create a dataframe using the date range we created above as the index

df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.163795 -0.791518  0.596761  0.534934
2013-01-02 -0.719706 -0.634151 -1.061877  0.148708
2013-01-03 -0.890389 -1.773278  0.246487 -1.156912
2013-01-04 -0.863312 -0.496558  1.041151  1.291419
2013-01-05 -0.475050  1.156079  1.026357 -0.855181
2013-01-06 -1.700899  0.448294 -2.310563  2.028869

In [9]:
dict = { "country": ["France", "USA", "Japan", "Italy"], "city I visited": ["Paris", "Laguna Beach", "Niseko", "Rome"], "rating": [5, 3.8, 5, 4 ]}

brics = pd.DataFrame(dict)

brics

  country city I visited  rating
0  France          Paris     5.0
1     USA   Laguna Beach     3.8
2   Japan         Niseko     5.0
3   Italy           Rome     4.0

In [11]:
brics.index= (["Fr", "US", "NP", "It"])
brics

   country city I visited  rating
Fr  France          Paris     5.0
US     USA   Laguna Beach     3.8
NP   Japan         Niseko     5.0
It   Italy           Rome     4.0